app/Controllers/Auth.php

        //Storing data

        $userModel = new \App\Models\UserModel();
        $query = $userModel->insert($data);
---
INSERT INTO `user` (`Name`, `email`, `Password`) VALUES ('test1', 'test1@gamil.com', '$2y$10$Jy4MUBFF7agk/cmUjMwkoe89djGZ0D3Zp3S71Z9CV3OOL9dKav.6q')

                    $Password = $this->request->getPost('Password');

                    $userModel = new UserModel();
                    $userInfo = $userModel->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'test1@gamil.com'
 LIMIT 1